app/Controllers/DataPendaftaran.php

SELECT *
FROM `tbl_pendaftaran`
WHERE `status_verifikasi` = 'Belum Verifikasi'
ORDER BY `created_at` DESC
---
	public function index()
	{
		$data['title']   = "SI AMANG | Data Pendaftaran";
		$data['page']    = "datapendaftaran";

		// periksa apakah session masih ada atau tidak
		if (!$this->session->has('nama') || !$this->session->has('email')) {
			return redirect()->to('/login');
		}

		$data['nama']   = $this->session->get('nama');
		$data['email']   = $this->session->get('email');

		// Ambil data pendaftaran yang terbaru dan belum diterima
		$tbl_pendaftaran = $this->M_pendaftaran->where('status_verifikasi', 'Belum Verifikasi')
			->orderBy('created_at', 'DESC')
			->findAll();