app/Controllers/Login.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@diskominfosan.ac.id'
 LIMIT 1
---
   public function cekUser()
{
    $email    = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    // ✅ Set rules + pass data request secara eksplisit
    $this->form_validation->setRules([
        'email'    => 'required|valid_email',
        'password' => 'required|min_length[8]',
    ]);

    // ✅ Run dengan data yang di-pass manual
    if (!$this->form_validation->run(['email' => $email, 'password' => $password])) {
        echo json_encode([
            'error'       => true,
            'login_error' => $this->form_validation->getErrors()
        ]);
        return;
    }

    // Cek user di database
    $cekUser = $this->M_user->where('email', $email)->first();