app/Models/JadwalModel.php

SELECT `tbl_jadwal`.*, `tbl_pendaftaran`.`nama_peserta`, `tbl_pendaftaran`.`judul`
FROM `tbl_jadwal`
JOIN `tbl_pendaftaran` ON `tbl_pendaftaran`.`id` = `tbl_jadwal`.`pendaftaran_id`
---
    public function getEvents()
    {
        $builder = $this->db->table('tbl_jadwal');
        $builder->select('tbl_jadwal.*, tbl_pendaftaran.nama_peserta, tbl_pendaftaran.judul');
        $builder->join('tbl_pendaftaran', 'tbl_pendaftaran.id = tbl_jadwal.pendaftaran_id');
        $query = $builder->get();

SELECT *
FROM `tbl_jadwal`
WHERE `pendaftaran_id` = '1'
---
    public function checkExistData($pendaftaran_id)
    {
        return $this->where('pendaftaran_id', $pendaftaran_id)->get()->getRow();