app/Models/KategoriModel.php

	public function getKategori()
	{
		return $this->findAll();
---
SELECT *
FROM `tbl_kategori`